Revit 2024 API
RevitLinkType.IsNestedLink Property
 Indicates whether this link is a nested or top-level link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsNestedLink { get; }
Visual Basic
Public ReadOnly Property IsNestedLink As Boolean
	Get
Visual C++
public:
property bool IsNestedLink {
	bool get ();
}
See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace